#ifndef IMAGINARYNOTION0X290_H
#define IMAGINARYNOTION0X290_H

#include "ceruleanemperor0x4c.h"
#include "ceruleanqueen0x58.h"
#include "compat.h"
#include "decomp.h"
#include "imaginaryinterface.h"
#include "obscureanchor0x5c.h"
#include "obscureicon0x1a8.h"
#include "types.h"

class BronzeFalcon0xc8770;
class CrimsonSun0xa4;
class GolExport;
class GolFontTable;
class GolStringTable;
class InputManager;
class ImaginaryDrillFieldAt0x420;
class MenuToolCreateParams0x30;
class ObscureVantage0x58;
class ObscureSigil0xdc;
class PorcelainVeil0x50;
class SoundGroupBinding;
class AwakeKite0x20;

// VTABLE: LEGORACERS 0x004b2308
// SIZE 0x290
class ImaginaryNotion0x290 : public ImaginaryInterface {
public:
	// SIZE 0x54
	class FieldAt0x54 : public ObscureVantage0x58::CreateParams0x30 {
	public:
		undefined m_unk0x30[0x50 - 0x30]; // 0x30
		LegoFloat m_unk0x50;              // 0x50
	};

	// SIZE unknown
	class FieldAt0xc4 {
	public:
		void SetUnk0x41(undefined p_unk0x41) { m_unk0x41 = p_unk0x41; }
		undefined4 GetUnk0x98() const { return m_unk0x98; }

	private:
		undefined m_unk0x00[0x41 - 0x00]; // 0x00
		undefined m_unk0x41;              // 0x41
		undefined m_unk0x42[0x98 - 0x42]; // 0x42
		undefined4 m_unk0x98;             // 0x98
	};

	ImaginaryNotion0x290();

	void VTable0x00(ObscureVantage0x58*) override;                                      // vtable+0x00
	void VTable0x04(ObscureVantage0x58*) override;                                      // vtable+0x04
	void VTable0x08(ObscureVantage0x58*) override;                                      // vtable+0x08
	void VTable0x0c(ObscureVantage0x58*) override;                                      // vtable+0x0c
	void VTable0x10(undefined4) override;                                               // vtable+0x10
	undefined4 VTable0x14(ObscureVantage0x58*, void*, undefined4, undefined4) override; // vtable+0x14
	undefined4 VTable0x18(
		ObscureVantage0x58*,
		OnyxCircularBuffer0x1c::Item*,
		undefined4,
		undefined4
	) override; // vtable+0x18
	undefined4 VTable0x1c(
		ObscureVantage0x58*,
		OnyxCircularBuffer0x1c::Item*,
		undefined4,
		undefined4
	) override;                                                                         // vtable+0x1c
	void VTable0x20(ObscureVantage0x58*) override;                                      // vtable+0x20
	void VTable0x24(ObscureVantage0x58*) override;                                      // vtable+0x24
	undefined4 VTable0x28(ObscureVantage0x58*, void*, undefined4, undefined4) override; // vtable+0x28
	void VTable0x2c(ObscureIcon0x1a8*) override;                                        // vtable+0x2c
	void VTable0x30(ObscureIcon0x1a8*) override;                                        // vtable+0x30
	void VTable0x34(ObscureIcon0x1a8*) override;                                        // vtable+0x34
	void VTable0x38(ObscureVantage0x58*) override;                                      // vtable+0x38
	void VTable0x3c(ObscureIcon0x1a8*) override;                                        // vtable+0x3c
	void VTable0x40(ObscureIcon0x1a8*) override;                                        // vtable+0x40
	void VTable0x44(undefined4) override;                                               // vtable+0x44
	void VTable0x48(undefined4) override;                                               // vtable+0x48
	virtual void VTable0x4c() = 0;                                                      // vtable+0x4c
	virtual undefined4 VTable0x50();                                                    // vtable+0x50
	virtual void Reset();                                                               // vtable+0x54
	virtual LegoBool32 VTable0x58(MenuToolCreateParams0x30*);                           // vtable+0x58
	virtual CeruleanEmperor0x4c* GetMenuStyles();                                       // vtable+0x5c
	virtual CeruleanEmperor0x4c* VTable0x60();                                          // vtable+0x60
	virtual CeruleanQueen0x58* GetMenuInputBindings();                                  // vtable+0x64
	virtual ~ImaginaryNotion0x290();                                                    // vtable+0x68
	virtual LegoFloat VTable0x6c();                                                     // vtable+0x6c
	virtual LegoBool32 Initialize(MenuToolCreateParams0x30*);                           // vtable+0x70
	virtual LegoBool32 Destroy();                                                       // vtable+0x74
	virtual LegoBool32 VTable0x78(undefined4);                                          // vtable+0x78
	virtual LegoBool32 VTable0x7c(Rect* p_arg1, Rect* p_arg2);                          // vtable+0x7c

	LegoBool32 FUN_0046b630();
	LegoBool32 FUN_0046b6e0(MenuToolCreateParams0x30*);
	void FUN_0046ba60(ObscureVantage0x58::CreateParams0x30*);
	void FUN_0046bb10(ObscureIcon0x1a8::CreateParams0x84*);
	void FUN_0046bb90(undefined4*, undefined4);
	void FUN_0046bc90(undefined4*, undefined4);
	void* FUN_0046bd80(undefined2);
	void* FUN_0046be10(undefined2);
	void FUN_0046bea0(undefined4*, undefined2);
	LegoBool32 FUN_0046bef0(ObscureAnchor0x5c*, undefined2, undefined2);
	LegoBool32 FUN_0046bf80(ImaginaryDrillFieldAt0x420*, undefined2, undefined2, undefined2);
	undefined4 FUN_0046c050(undefined4*, undefined2, undefined2);
	undefined4 FUN_0046c110(undefined4*, undefined2, undefined2);
	undefined4 FUN_0046c1b0(undefined4*, undefined2, undefined2);
	undefined4 FUN_0046c240(undefined4*, undefined2, undefined2);
	void FUN_0046c2b0(undefined4*, undefined4, undefined2, undefined2);
	undefined4 FUN_0046c400(undefined4*, undefined2, undefined2);
	LegoBool32 FUN_0046c480(ObscureSigil0xdc* p_unk0x04, undefined4 p_unk0x08, undefined2 p_unk0x0c);
	void FUN_0046c510(undefined4*, undefined4, undefined2);
	undefined4 FUN_0046c5b0(ObscureVantage0x58*, undefined2);
	undefined4 FUN_0046c610(undefined4*, undefined2, undefined2, undefined2, undefined4);
	undefined4 FUN_0046c6f0(ObscureIcon0x1a8*, ObscureIcon0x1a8*, undefined2);
	undefined4 FUN_0046c730(ObscureIcon0x1a8*, undefined2);
	void FUN_0046c760();
	ObscureIcon0x1a8* GetUnk0xd8() { return &m_unk0xd8; }

	CeruleanEmperor0x4c::Entry0x0c* GetStyleEntry0x0c(undefined2 p_id)
	{
		return static_cast<CeruleanEmperor0x4c::Entry0x0c*>(FUN_0046bd80(p_id));
	}

	CeruleanEmperor0x4c::Entry0x104* GetStyleEntry0x104(undefined2 p_id)
	{
		return static_cast<CeruleanEmperor0x4c::Entry0x104*>(FUN_0046bd80(p_id));
	}

	CeruleanQueen0x58::Entry0x3c* GetInputBindingEntry0x3c(undefined2 p_id)
	{
		return static_cast<CeruleanQueen0x58::Entry0x3c*>(FUN_0046be10(p_id));
	}

	CeruleanQueen0x58::Entry0x84* GetInputBindingEntry0x84(undefined2 p_id)
	{
		return static_cast<CeruleanQueen0x58::Entry0x84*>(FUN_0046be10(p_id));
	}

	FieldAt0x54* GetInputBindingEntry0x54(undefined2 p_id) { return static_cast<FieldAt0x54*>(FUN_0046be10(p_id)); }

	// SYNTHETIC: LEGORACERS 0x0046b3f0
	// ImaginaryNotion0x290::`scalar deleting destructor'

protected:
	LegoBool32 m_initialized;                        // 0x004
	CeruleanEmperor0x4c m_unk0x08;                   // 0x008
	PorcelainVeil0x50* m_menuStyles;                 // 0x054
	CeruleanQueen0x58 m_unk0x58;                     // 0x058
	GolExport* m_golExport;                          // 0x0b4
	BronzeFalcon0xc8770* m_renderer;                 // 0x0b8
	AwakeKite0x20* m_unk0xbc;                        // 0x0bc
	GolFontTable* m_fontTable;                       // 0x0c0
	FieldAt0xc4* m_unk0xc4;                          // 0x0c4
	OnyxCircularBuffer0x1c* m_inputBindingContainer; // 0x0c8
	InputManager* m_inputManager;                    // 0x0cc
	GolStringTable* m_menuNameStrings;               // 0x0d0
	GolStringTable* m_menuTextStrings;               // 0x0d4
	ObscureIcon0x1a8 m_unk0xd8;                      // 0x0d8
	SoundGroupBinding* m_soundGroupBinding;          // 0x280
	CrimsonSun0xa4* m_unk0x284;                      // 0x284
	undefined4 m_unk0x288;                           // 0x288
	undefined2 m_unk0x28c;                           // 0x28c
};

#endif // IMAGINARYNOTION0X290_H
