#ifndef SCARLETNOVA0X5C_H
#define SCARLETNOVA0X5C_H

#include "decomp.h"
#include "types.h"

class AmberHaze0x1c;
class IGdbModel0x40;
class MagentaRibbon0x20;

// SIZE 0x5c
class ScarletNova0x5c {
public:
	undefined m_unk0x00[4];           // 0x00
	LegoBool m_flag;                  // 0x04
	undefined m_unk0x05[0x0c - 0x05]; // 0x05
	undefined4 m_unk0x0c;             // 0x0c
	undefined m_unk0x10[0x20 - 0x10]; // 0x10
	IGdbModel0x40* m_unk0x20;         // 0x20
	AmberHaze0x1c* m_unk0x24;         // 0x24
	MagentaRibbon0x20* m_unk0x28;     // 0x28
	LegoChar m_unk0x2c[14];           // 0x2c
	undefined m_unk0x3a[0x44 - 0x3a]; // 0x3a
	IGdbModel0x40* m_unk0x44;         // 0x44
	AmberHaze0x1c* m_unk0x48;         // 0x48
	MagentaRibbon0x20* m_unk0x4c;     // 0x4c
	undefined m_unk0x50[0x5c - 0x50]; // 0x50
};

#endif // SCARLETNOVA0X5C_H
